# Bonus: Temperature Analysis I

In [1]:
import pandas as pd
from datetime import datetime as dt

In [6]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [7]:
# Convert the date column format from string to datetime
df["date"] = pd.to_datetime(df["date"])

In [8]:
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [9]:
# Set the date column as the DataFrame index
df.set_index("date", drop = True, inplace = True)

In [11]:
# Drop the date column
df.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

### Compare June and December data across all years

In [12]:
from scipy import stats

In [16]:
# Filter data for desired months
june_df = df[df.index.month.isin([6])]
june_df.head(-5)

                station  prcp  tobs
date
2010-06-01  USC00519397  0.00    78
2010-06-02  USC00519397  0.01    76
2010-06-03  USC00519397  0.00    78
2010-06-04  USC00519397  0.00    76
2010-06-05  USC00519397  0.00    77
...                 ...   ...   ...
2017-06-21  USC00516128  0.30    75
2017-06-22  USC00516128  0.28    76
2017-06-23  USC00516128  0.50    71
2017-06-24  USC00516128  0.22    73
2017-06-25  USC00516128  0.50    79

[1695 rows x 3 columns]

In [18]:
december_df = df[df.index.month.isin([12])]
december_df.head(-5)

                station  prcp  tobs
date
2010-12-01  USC00519397  0.04    76
2010-12-03  USC00519397  0.00    74
2010-12-04  USC00519397  0.00    74
2010-12-06  USC00519397  0.00    64
2010-12-07  USC00519397  0.00    64
...                 ...   ...   ...
2016-12-22  USC00516128  1.24    68
2016-12-23  USC00516128  0.83    69
2016-12-24  USC00516128  1.08    69
2016-12-25  USC00516128  0.38    69
2016-12-26  USC00516128  1.48    71

[1512 rows x 3 columns]

In [23]:
# Identify the average temperature for June
june_avg = round(june_df["tobs"].mean(),2)
print(f"The average temperature in June is {june_avg} degrees Fahrenheit")

The average temperature in June is 73.1 degrees Fahrenheit

In [25]:
# Identify the average temperature for December
dec_avg = round(december_df["tobs"].mean(),2)
print(f"The average temperature in December is {dec_avg} degrees Fahrenheit")

The average temperature in December is 71.04 degrees Fahrenheit

In [31]:
# Collect sample of data
dec_sample = december_df.sample(n = 100)
june_sample = june_df.sample(n = 100)

In [32]:
# Run paired t-test
stats.ttest_rel(dec_sample.tobs, june_sample.tobs)

Ttest_relResult(statistic=-9.080108388696106, pvalue=1.1090611518533448e-14)

### Analysis

Based on the paired T-test results, there is a signficant difference between the temperatures in June and in December in Hawaii desipte the average temperatures of the two months being only 2 degrees Fahrenheit apart.